li59533/JunYue_Lora/code/stm32l4xx/stm32l4xx/projects/stm32l4xx/source/application/tempareture_task/temperature_task.c
/**
 **************************************************************************************************
 * @file        temperature_task.c
 * @author
 * @version   v0.1.0
 * @date        
 * @brief
 **************************************************************************************************
 * @attention
 *
 **************************************************************************************************
 */
#include "temperature_task.h"

/**
 * @addtogroup    XXX 
 * @{  
 */
#include "clog.h"
#include "FreeRTOS.h"
#include "task.h"
#include "stm32_bsp_conf.h"
#include "system_param.h"
#include "bsp_lmt01.h"

#include "app_conf.h"
#include "bsp_led.h"

#include "rtos_tools.h"
/**
 * @addtogroup    temperature_task_Modules 
 * @{  
 */

/**
 * @defgroup      temperature_task_IO_Defines 
 * @brief         
 * @{  
 */

/**
 * @}
 */

/**
 * @defgroup      temperature_task_Macros_Defines 
 * @brief         
 * @{  
 */

/**
 * @}
 */
 
/**
 * @defgroup      temperature_task_Constants_Defines 
 * @brief         
 * @{  
 */

/**
 * @}
 */

/**
 * @defgroup      temperature_task_Private_Types
 * @brief         
 * @{  
 */

/**
 * @}
 */
 
/**
 * @defgroup      temperature_task_Private_Variables 
 * @brief         
 * @{  
 */

/**
 * @}
 */
 
/**
 * @defgroup      temperature_task_Public_Variables 
 * @brief         
 * @{  
 */
TaskHandle_t  Temperature_Task_Handle = NULL;
/**
 * @}
 */

/**
 * @defgroup      temperature_task_Private_FunctionPrototypes 
 * @brief         
 * @{  
 */
static void Temperature_Task_1s(void);
/**
 * @}
 */

/**
 * @defgroup      temperature_task_Functions 
 * @brief         
 * @{  
 */


uint32_t Temperature_Task_Init(void)
{
	BaseType_t basetype = { 0 };
	basetype = xTaskCreate(Temperature_Task,\
							"Temperature_Task",\
							512,
							NULL,
							4,
							&Temperature_Task_Handle);
	return basetype;
}

void Temperature_Task(void * pvParameter)
{
	BSP_LMT01_Power_ON();
	DEBUG("Temperature Task Enter\r\n");
	while(1)
	{
		//Bsp_LedToggle(BSP_LED_TEST);
		//DEBUG("Temperature Task Looping\r\n");

		RTOS_Delay_ms(20);
		BSP_LMT01_CoreLoop();
		Temperature_Task_1s();
		//snprintf(str_temp,30,"%0.3f",g_SystemParam_Param.pdate);
		//DEBUG("Temperature:%s\r\n",str_temp);
	}
}
	
static void Temperature_Task_1s(void)
{
	static uint8_t count = 0 ;
	count ++ ; 
	if(count == 50)
	{
		char str_temp[30];
		count = 0;
		
		if(BSP_LMT01_GetDataStatus() != LMT01_Updata_HasUp && BSP_LMT01_GetMidValue() == 0)
		{
			g_SystemParam_Param.pdate = -50.0f;
		}
		else
		{
			g_SystemParam_Param.pdate = BSP_LMT01_GetMidValue();
		}

		if(g_SystemParam_Param.pdate < -40.0)
		{
			DEBUG("!!!!\r\n");
		}
		
		snprintf(str_temp,30,"%0.3f",g_SystemParam_Param.pdate);
		DEBUG("Temperature:%s\r\n",str_temp);
		
	}
}


/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

